{
  "videos": [
    {
      "id": "finance_basics",
      "title": "Finance Basics",
      "video_url": "https://youtu.be/dyaG7zEtJ7U",
      "topic": "Finance",
      "script": [
        "Have you ever stopped to ask yourself where your money actually goes each month—like, really goes, not just what you think you spend it on?",
        "Most people believe they have a “money problem,” but often it’s actually a decision problem—small choices made on autopilot, every single day.",
        "We work for years trading time we can never get back, yet many of us never learn how money truly works.",
        "Isn’t it strange that school teaches us geometry and poetry, but not how to manage a paycheck or build wealth?",
        "Some people say they want financial freedom, but continue to spend money to impress people who aren’t even thinking about them.",
        "Meanwhile, the quiet people—who track their spending, invest consistently, and avoid quick thrills—may look ordinary today, but they’re building a life others will someday call “lucky.",
        "What if your future lifestyle is being shaped right now by habits you barely notice?",
        "Are your purchases today reflections of your goals—or distractions from them?",
        "Money won’t solve every problem, but it will magnify your patterns: discipline becomes independence, and carelessness becomes stress.",
        "What are your philosophies on managing finances - do you believe in saving for your nest egg? or focusing primarily on taking care of dependents? or just living every day as it comes?",
        "So the real question is—are you controlling your money, or is it quietly controlling you?"
      ],
      "followup_questions": [
        "What does financial security mean to you personally?",
        "How do you typically make decisions about spending money?",
        "What are your biggest financial concerns or worries?",
        "How do you feel when you think about saving money?",
        "What financial goals are most important to you right now?",
        "How does your family background influence your views on money?",
        "What would you do differently if you had better financial knowledge?",
        "How do you balance enjoying life today with planning for the future?"
      ]
    }
  ]
}

